/* ch03-3-4.c - 七节显示器实验程序  */
//==声明区=====================================
#include	<reg51.h> // 定义8051暂存器的标头档,P2-17~19 
#define	SEG	P0		//	定义七节显示器接至Port 0
/* 声明七节显示器驱动信号阵列(共阳) */
char code TAB[10]={	0xc0, 0xf9, 0xa4, 0xb0, 0x99,	// 数字0-4
					0x92, 0x83, 0xf8, 0x80, 0x98 };	// 数字5-9
void delay(int);		//	声明延迟函数 
//==主程序=====================================
main()					//	主程序开始 
{	unsigned char i;	//	声明无号数字元变数i
	while(1)			//	无穷循环,程序一直跑 
		for(i=0;i<10;i++)	//	显示0-9,共10次 
	{	SEG=TAB[i];		//	显示数字 
			delay(500);	//	延迟500 1m=0.5秒 
		}				//	for循环结束 
}						//	主程序结束 
//==子程序=====================================
/* 延迟函数,延迟约x 1ms */
void delay(int x)		//	延迟函数开始 
{	int i,j;			//	声明整数变数i,j 
	for (i=0;i<x;i++)	//	计数x次,延迟x 1ms 
		for (j=0;j<120;j++);//	计数120次，延迟1ms 
}						//	延迟函数结束 
